public class Starting
{
    public Starting()
    {

    }
    static void Main(string[] args)
    {
        Console.WriteLine("СВИНЯ");
        Console.WriteLine("Введіть s, щоб розпочати");
        Console.WriteLine("        r - правила гри та команди");
    mark:
        string choise = Console.ReadLine();
        if (choise.Equals("r"))
        {
            Console.Write("Ви граєте проти комп'ютера. Під час свого ходу ви можете кинути кубик(введіть d),\n або записати очки і передати хід супернику(введіть pass).");
            Console.WriteLine("Якщо під час кидка кості випало значення від 2 до 6, воно додається в малий рахунок. Гравець може кидати кості доти, доки він не зупиниться або поки не випаде 1.\n Якщо випала 1, малий рахунок обнулюється і гравець отримує 0 балів за весь хід. Хід передається наступному гравцеві.");
            Console.WriteLine("Якщо гравець вирішує зупинитися, очки з малого рахунку зараховуються у загальний і хід передається супернику.\n Гра завершується, коли один з учасників набирає 100 і більше очок в загальному рахунку.");
            Console.WriteLine("Команди та чіти: limit <натуральне число без дужок> - встановити кількість очок для перемоги. Доступна лише в меню");
            Console.WriteLine("                  me <натуральне число без дужок> - змінити ваш загальний рахунок (чіти). Доступна лише під час гри");
            Console.WriteLine("                  bot <натуральне число без дужок> - змінити загальний рахунок бота (чіти). Доступна лише під час гри");
            goto mark;
        }
        if (choise.Equals("s"))
        {
            GameManager gm = new GameManager();
            gm.Startin();
        }
    }
}